src/cf/ChartsOfCharacteristicTypes/аа_ПредопределенныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>аа_ПредопределенныеЗначения</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>22</v8:Digits>
					<v8:FractionDigits>5</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдноЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньИерархии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Значения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.аа_ПредопределенныеЗначения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/cf/CommonModules/аа_ПредопределенныеЗначения/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Обновляет список предопределенных значений. Добавляет новые, актуализирует свойства текущих, помечает на удаление устаревшие.
//
Процедура АктуализироватьПредопределенныеЗначения() Экспорт
	
	ОписаниеПредопределенныхЗначений = ОписаниеПредопределенныхЗначений();
	
	КэшЗначений = КэшЗначений();
	ИнициализироватьКэшПредопределенныхЗначений(ОписаниеПредопределенныхЗначений, КэшЗначений);
	
	Для Каждого ПредопределенноеЗначение Из ОписаниеПредопределенныхЗначений Цикл
		
		ПВХОбъект = СоздатьОбновитьПредопределенноеЗначение(ПредопределенноеЗначение, КэшЗначений);
		
		ЗаписатьПредопределенноеЗначение(ПВХОбъект, КэшЗначений);
		
	КонецЦикла;
	
	ПометитьНаУдалениеУстаревшиеИдентификаторы(ОписаниеПредопределенныхЗначений);
	
КонецПроцедуры

// Добавляет новую группу предопределенных значений.
//
// Параметры:
//  ОписаниеПредопределенных 	- ТаблицаЗначений 	- Таблица с описанием предопределенных значений. См. аа_ПредопределенныеЗначения.ТаблицаПредопределенныхЗначений().
//  Наименование 				- Строка 			- Имя группы.
//  Идентификатор 				- Строка 			- Идентификатор группы (уникальный).
//  Описание 					- Строка 			- Описание группы.
//  ИдентификаторРодителя 		- Строка 			- Идентификатор родительской группы. Если заполнено, новая группа будет создана в иерархии родителя.
//
Процедура ДобавитьГруппу(
		ОписаниеПредопределенных, Наименование, Идентификатор, Описание = "", ИдентификаторРодителя = "") Экспорт
	
	НоваяГруппа = ОписаниеПредопределенных.Добавить();
	
	НоваяГруппа.Наименование 			= Наименование;
	НоваяГруппа.Описание 				= Описание;
	НоваяГруппа.Идентификатор 			= Идентификатор;
	НоваяГруппа.ИдентификаторРодителя 	= ИдентификаторРодителя;
	НоваяГруппа.ЭтоГруппа 				= Истина;
	
КонецПроцедуры

// Добавляет новое предопределенное значение.
//
// Параметры:
//  ОписаниеПредопределенных 	- ТаблицаЗначений 	- Таблица с описанием предопределенных значений. См. аа_ПредопределенныеЗначения.ТаблицаПредопределенныхЗначений().
//  Наименование 				- Строка 			- Имя предопределенного значения.
//  Идентификатор 				- Строка 			- Идентификатор предопределенного значения (уникальный).
//  ТипЗначения 				- ОписаниеТипов 	- Доступные типы значений.
//  Описание 					- Строка 			- Описание предопределенного значения.
//  ИдентификаторРодителя 		- Строка 			- Идентификатор родительской группы. Если заполнено, новое значение будет создано в иерархии родителя.
//
Процедура ДобавитьЗначение(
		ОписаниеПредопределенных, Наименование, Идентификатор,
		ТипЗначения, Описание = "", ИдентификаторРодителя = "") Экспорт
	
	НовоеЗначение = ОписаниеПредопределенных.Добавить();
	
	НовоеЗначение.Наименование 				= Наименование;
	НовоеЗначение.Описание 					= Описание;
	НовоеЗначение.Идентификатор 			= Идентификатор;
	НовоеЗначение.ИдентификаторРодителя 	= ИдентификаторРодителя;
	НовоеЗначение.ТипЗначения 				= ТипЗначения;
	
КонецПроцедуры

// Возвращает массив со значениями предопределенных значений.
//
// Параметры:
//  Идентификатор - Строка - Идентификатор предопределеннго значения.
// 
// Возвращаемое значение:
//  Массив - Массив значений по идентификатору предопределенного значения.
//
Функция ЗначенияНастройки(Идентификатор) Экспорт
	
	Возврат аа_ПредопределенныеЗначенияПовтИсп.ЗначенияНастройки(Идентификатор);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КэшЗначений()
	
	Результат = Новый Структура;
	Результат.Вставить("Группы", Новый Соответствие);
	Результат.Вставить("Значения", Новый Соответствие);
	
	Возврат Результат;
	
КонецФункции

Процедура ИнициализироватьКэшПредопределенныхЗначений(ОписаниеПредопределенныхЗначений, КэшЗначений)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПредопределенныеЗначения", ОписаниеПредопределенныхЗначений);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПредопределенныеЗначения.Идентификатор КАК Идентификатор,
		|	ПредопределенныеЗначения.ЭтоГруппа КАК ЭтоГруппа
		|ПОМЕСТИТЬ втПредопределенныеЗначения
		|ИЗ
		|	&ПредопределенныеЗначения КАК ПредопределенныеЗначения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПредопределенныеЗначения.Идентификатор КАК Идентификатор,
		|	втПредопределенныеЗначения.ЭтоГруппа КАК ЭтоГруппа,
		|	аа_ПредопределенныеЗначения.Ссылка КАК Ссылка
		|ИЗ
		|	втПредопределенныеЗначения КАК втПредопределенныеЗначения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.аа_ПредопределенныеЗначения КАК аа_ПредопределенныеЗначения
		|		ПО втПредопределенныеЗначения.Идентификатор = аа_ПредопределенныеЗначения.Идентификатор
		|			И втПредопределенныеЗначения.ЭтоГруппа = аа_ПредопределенныеЗначения.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГруппа Тогда
			КэшЗначений.Группы.Вставить(Выборка.Идентификатор, Выборка.Ссылка);
		Иначе
			КэшЗначений.Значения.Вставить(Выборка.Идентификатор, Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СсылкаНаПредопределенноеЗначение(Идентификатор, ЭтоГруппа, КэшЗначений)
	
	Возврат ?(ЭтоГруппа, КэшЗначений.Группы.Получить(Идентификатор), КэшЗначений.Значения.Получить(Идентификатор));
	
КонецФункции

Процедура ЗаписатьПредопределенноеЗначение(ПВХОбъект, КэшЗначений)
	
	ПВХОбъект.Записать();
	
	Если ПВХОбъект.ЭтоГруппа Тогда
		КэшЗначений.Группы.Вставить(ПВХОбъект.Идентификатор, ПВХОбъект.Ссылка);
	Иначе
		КэшЗначений.Значения.Вставить(ПВХОбъект.Идентификатор, ПВХОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПометитьНаУдалениеУстаревшиеИдентификаторы(ОписаниеПредопределенныхЗначений)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПредопределенныеЗначения", ОписаниеПредопределенныхЗначений);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПредопределенныеЗначения.Идентификатор КАК Идентификатор,
		|	ПредопределенныеЗначения.ЭтоГруппа КАК ЭтоГруппа
		|ПОМЕСТИТЬ втПредопределенныеЗначения
		|ИЗ
		|	&ПредопределенныеЗначения КАК ПредопределенныеЗначения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	аа_ПредопределенныеЗначения.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.аа_ПредопределенныеЗначения КАК аа_ПредопределенныеЗначения
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПредопределенныеЗначения КАК втПредопределенныеЗначения
		|		ПО аа_ПредопределенныеЗначения.Идентификатор = втПредопределенныеЗначения.Идентификатор
		|			И аа_ПредопределенныеЗначения.ЭтоГруппа = втПредопределенныеЗначения.ЭтоГруппа
		|ГДЕ
		|	втПредопределенныеЗначения.Идентификатор ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПВХОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПВХОбъект.УстановитьПометкуУдаления(Истина, Ложь);
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьОбновитьПредопределенноеЗначение(ОписаниеПредопределенного, КэшЗначений)
	
	ЭтоНовый = Ложь;
	
	ПВХСсылка = СсылкаНаПредопределенноеЗначение(
		ОписаниеПредопределенного.Идентификатор, ОписаниеПредопределенного.ЭтоГруппа, КэшЗначений);
	
	Если Не ЗначениеЗаполнено(ПВХСсылка) Тогда
		
		ЭтоНовый = Истина;
		
		Если ОписаниеПредопределенного.ЭтоГруппа Тогда
			ПВХОбъект = ПланыВидовХарактеристик.аа_ПредопределенныеЗначения.СоздатьГруппу();
		Иначе
			ПВХОбъект = ПланыВидовХарактеристик.аа_ПредопределенныеЗначения.СоздатьЭлемент();
		КонецЕсли;
		
	Иначе
		ПВХОбъект = ПВХСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьОбщиеСвойстваПВХ(ПВХОбъект, ОписаниеПредопределенного, ЭтоНовый, КэшЗначений);
	
	Если Не ПВХОбъект.ЭтоГруппа Тогда
		
		Если ПВХОбъект.ОдноЗначение Тогда
			
			ПВХОбъект.СписокЗначений = Ложь;
			Пока ПВХОбъект.Значения.Количество() > 1 Цикл
				ПВХОбъект.Значения.Удалить(
					ПВХОбъект.Значения.Индекс(ПВХОбъект.Значения[ПВХОбъект.Значения.Количество() - 1]));
			КонецЦикла;
			
		КонецЕсли;
		
		Если ПВХОбъект.Значения.Количество() = 0 Тогда
			ПВХОбъект.Значения.Добавить();
		КонецЕсли;
		
	КонецЕсли;
	
	ПВХОбъект.ПометкаУдаления = Ложь;
	
	Возврат ПВХОбъект;
	
КонецФункции

Процедура ЗаполнитьОбщиеСвойстваПВХ(ПВХОбъект, ОписаниеПредопределенного, ЭтоНовый, КэшЗначений)
	
	Если ОписаниеПредопределенного.ЭтоГруппа Тогда
		СписокСвойств = "Наименование, Идентификатор, Описание";
		ИсключаяСвойства = Неопределено;
	ИначеЕсли ЭтоНовый Тогда
		ИсключаяСвойства = Неопределено;
	Иначе
		СписокСвойств = Неопределено;
		ИсключаяСвойства = "СписокЗначений";
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ПВХОбъект, ОписаниеПредопределенного, СписокСвойств, ИсключаяСвойства);
	
	Если ЗначениеЗаполнено(ОписаниеПредопределенного.ИдентификаторРодителя) Тогда
		ПВХОбъект.Родитель = СсылкаНаПредопределенноеЗначение(
			ОписаниеПредопределенного.ИдентификаторРодителя, Истина, КэшЗначений);
	КонецЕсли;
	
КонецПроцедуры

Функция ТаблицаПредопределенныхЗначений()
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	ДлинаНаименования = 150;
	ДлинаОписания = 1024;
	ДлинаИдентификатора = 333;
	
	ПредопределенныеЗначения = Новый ТаблицаЗначений;
	
	ПредопределенныеЗначения.Колонки.Добавить("Наименование", ОписаниеТипаСтрока(ДлинаНаименования));
	ПредопределенныеЗначения.Колонки.Добавить("Описание", ОписаниеТипаСтрока(ДлинаОписания));
	ПредопределенныеЗначения.Колонки.Добавить("Идентификатор", ОписаниеТипаСтрока(ДлинаИдентификатора));
	ПредопределенныеЗначения.Колонки.Добавить("ИдентификаторРодителя", ОписаниеТипаСтрока(ДлинаИдентификатора));
	ПредопределенныеЗначения.Колонки.Добавить("СписокЗначений", ТипБулево);
	ПредопределенныеЗначения.Колонки.Добавить("ОдноЗначение", ТипБулево);
	ПредопределенныеЗначения.Колонки.Добавить("ТипЗначения", Новый ОписаниеТипов("ОписаниеТипов"));
	ПредопределенныеЗначения.Колонки.Добавить("ЭтоГруппа", ТипБулево);
	ПредопределенныеЗначения.Колонки.Добавить("УровеньИерархии", ТипЧисло);
	
	Возврат ПредопределенныеЗначения;
	
КонецФункции

Функция ОписаниеТипаСтрока(Длина)
	Возврат Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(Длина));
КонецФункции

Процедура ЗаполнитьУровниИерархии(ПредопределенныеЗначения)
	
	КоличествоСтрок = ПредопределенныеЗначения.Количество();
	КоличествоЗаполненныхСтрок = 0;
	
	УровеньИерархии = 0;
	УровниИерархии = Новый Соответствие;
	Пока КоличествоЗаполненныхСтрок <> КоличествоСтрок Цикл
		
		Для Каждого СтрокаПредопределенных Из ПредопределенныеЗначения Цикл
			
			Если ЗначениеЗаполнено(СтрокаПредопределенных.УровеньИерархии)
				Или Не ЗначениеЗаполнено(СтрокаПредопределенных.ИдентификаторРодителя)
					И УровеньИерархии > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			УровеньИерархииРодителя = УровниИерархии.Получить(СтрокаПредопределенных.ИдентификаторРодителя);
			
			ЭтоКорневойЭлемент = УровеньИерархии = 0
				И Не ЗначениеЗаполнено(СтрокаПредопределенных.ИдентификаторРодителя);
			
			Если ЭтоКорневойЭлемент
				Или УровеньИерархииРодителя <> Неопределено Тогда
				
				СтрокаПредопределенных.УровеньИерархии = УровеньИерархии;
				УровниИерархии.Вставить(СтрокаПредопределенных.Идентификатор, УровеньИерархии);
				
				КоличествоЗаполненныхСтрок = КоличествоЗаполненныхСтрок + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
		УровеньИерархии = УровеньИерархии + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОписаниеПредопределенныхЗначений()
	
	ПредопределенныеЗначения = ТаблицаПредопределенныхЗначений();
	
	аа_ПредопределенныеЗначенияПереопределяемый.ЗаполнитьПредопределенныеЗначения(ПредопределенныеЗначения);
	
	ЗаполнитьУровниИерархии(ПредопределенныеЗначения);
	
	Возврат ПредопределенныеЗначения;
	
КонецФункции

#КонецОбласти
